adrianbica/BLE_thpsensor_nrf52840/src/main.cpp
/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/


/**@brief Function for handling the THP Sensing Service events.
 *
 * @details This function will be called for all THP Sensing Service events which are passed to
 *          the application.
 *
 * @param[in]   p_thp_sensing_service   THP Sensing Service structure.
 * @param[in]   p_evt   Event received from the THP Sensing Service.
 */
static void on_thp_sensing_service_evt(THPSensingService *p_thp_sensing_service, SensingServiceEvent *p_evt)
{
    switch (p_evt->evt_type)
    { 
        case BLE_THP_SENSING_SERVICE_HUMIDITY_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("THP_SENSING_SERVICE_HUMIDITY evt NOTIFICATION_ENABLED. \r\n");
            break;
        case BLE_THP_SENSING_SERVICE_HUMIDITY_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("THP_SENSING_SERVICE_HUMIDITY evt NOTIFICATION_DISABLED. \r\n");
            break;
        case BLE_THP_SENSING_SERVICE_HUMIDITY_EVT_CCCD_WRITE:
            NRF_LOG_INFO("THP_SENSING_SERVICE_HUMIDITY evt CCCD_WRITE. \r\n");
            break; 
        case BLE_THP_SENSING_SERVICE_PRESSURE_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("THP_SENSING_SERVICE_PRESSURE evt NOTIFICATION_ENABLED. \r\n");
            break;
        case BLE_THP_SENSING_SERVICE_PRESSURE_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("THP_SENSING_SERVICE_PRESSURE evt NOTIFICATION_DISABLED. \r\n");
            break;
        case BLE_THP_SENSING_SERVICE_PRESSURE_EVT_CCCD_WRITE:
            NRF_LOG_INFO("THP_SENSING_SERVICE_PRESSURE evt CCCD_WRITE. \r\n");
            break; 
        case BLE_THP_SENSING_SERVICE_TEMPERATURE_EVT_NOTIFICATION_ENABLED:
            NRF_LOG_INFO("THP_SENSING_SERVICE_TEMPERATURE evt NOTIFICATION_ENABLED. \r\n");
            break;
        case BLE_THP_SENSING_SERVICE_TEMPERATURE_EVT_NOTIFICATION_DISABLED:
            NRF_LOG_INFO("THP_SENSING_SERVICE_TEMPERATURE evt NOTIFICATION_DISABLED. \r\n");
            break;
        case BLE_THP_SENSING_SERVICE_TEMPERATURE_EVT_CCCD_WRITE:
            NRF_LOG_INFO("THP_SENSING_SERVICE_TEMPERATURE evt CCCD_WRITE. \r\n");
            break; 
        default:
            // No implementation needed.
            break;
    } 
}

/**@brief Function for handling the LED CONTROL SERVICE events.
 *
 * @details This function will be called for all LED CONTROL SERVICE events which are passed to
 *          the application.
 *
 * @param[in]   p_led_control_service   LED CONTROL SERVICE structure.
 * @param[in]   p_evt   Event received from the LED CONTROL SERVICE.
 */
static void on_led_service_evt(LedService *p_led_control_service, LedServiceEvent * p_evt)
{
    switch (p_evt->evt_type)
    { 
        case BLE_LED_SERVICE_DIGITAL_EVT_WRITE:
            NRF_LOG_INFO("LED_SERVICE_DIGITAL evt WRITE. \r\n");
            if ((p_evt->params.digital.digital[0] & 0x03) == 0x01) {
                bsp_board_led_on(0);
            } else {
                bsp_board_led_off(0);
            }
            if ((p_evt->params.digital.digital[1] & 0x03) == 0x01) {
                bsp_board_led_on(1);
            } else {
                bsp_board_led_off(1);
            }
            if ((p_evt->params.digital.digital[2] & 0x03) == 0x01) {
                bsp_board_led_on(2);
            } else {
                bsp_board_led_off(2);
            }
            if ((p_evt->params.digital.digital[3] & 0x03) == 0x01) {
                bsp_board_led_on(3);
            } else {
                bsp_board_led_off(3);
            }
            break; 
        default:
            // No implementation needed.
            NRF_LOG_INFO("LED_SERVICE_DIGITAL evt: %d\r\n", p_evt->evt_type);
            break;
    }
}

/**@brief Function for handling the LED CONTROL SERVICE events.
 *
 * @details This function will be called for all LED CONTROL SERVICE events which are passed to
 *          the application.
 *
 * @param[in]   p_led_control_service   LED CONTROL SERVICE structure.
 * @param[in]   p_evt   Event received from the LED CONTROL SERVICE.
 */
static void on_relay_service_evt(RelayService *p_led_control_service, RelayServiceEvent * p_evt)
{
    switch (p_evt->evt_type)
    { 
        case BLE_RELAY_SERVICE_DIGITAL_EVT_WRITE:
            NRF_LOG_INFO("RELAY_SERVICE_DIGITAL evt WRITE. \r\n");
            if ((p_evt->params.digital.digital[0] & 0x03) == 0x01) {
                nrf_gpio_pin_write(RELAY_1, 0);
            } else {
                nrf_gpio_pin_write(RELAY_1, 1);
            }
            if ((p_evt->params.digital.digital[1] & 0x03) == 0x01) {
                nrf_gpio_pin_write(RELAY_2, 0);
            } else {
                nrf_gpio_pin_write(RELAY_2, 1);
            }
            if ((p_evt->params.digital.digital[2] & 0x03) == 0x01) {
                nrf_gpio_pin_write(RELAY_3, 0);
            } else {
                nrf_gpio_pin_write(RELAY_3, 1);
            }
            if ((p_evt->params.digital.digital[3] & 0x03) == 0x01) {
                nrf_gpio_pin_write(RELAY_4, 0);
            } else {
                nrf_gpio_pin_write(RELAY_4, 1);
            }
            break; 
        default:
            // No implementation needed.
            NRF_LOG_INFO("RELAY_SERVICE_DIGITAL evt: %d\r\n", p_evt->evt_type);
            break;
    }
}

APP_PWM_INSTANCE(PWM1,1);                   // Create the instance "PWM1" using TIMER1.

