adrianbica/BLE_thpsensor_nrf52840/src/main.cpp
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated when button is pressed.
 */
static void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break; // BSP_EVENT_SLEEP

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break; // BSP_EVENT_DISCONNECT

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist(&m_advertising);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break; // BSP_EVENT_KEY_0

        default:
            break;
    }
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);

    nrf_gpio_pin_write(RELAY_1, 1);
    nrf_gpio_pin_write(RELAY_2, 1);
    nrf_gpio_pin_write(RELAY_3, 1);
    nrf_gpio_pin_write(RELAY_4, 1);
    nrf_gpio_pin_dir_set(RELAY_1, NRF_GPIO_PIN_DIR_OUTPUT);
    nrf_gpio_pin_dir_set(RELAY_2, NRF_GPIO_PIN_DIR_OUTPUT);
    nrf_gpio_pin_dir_set(RELAY_3, NRF_GPIO_PIN_DIR_OUTPUT);
    nrf_gpio_pin_dir_set(RELAY_4, NRF_GPIO_PIN_DIR_OUTPUT);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED evetnt
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}


//THPSensor thp_sensor;



//static nrf_drv_pwm_t m_pwm0 = NRF_DRV_PWM_INSTANCE(0);

void pwm_init(void)
{
    ret_code_t err_code;
#if(1)
    nrf_gpio_pin_dir_set(31, NRF_GPIO_PIN_DIR_OUTPUT);
    app_pwm_config_t pwm1_cfg = APP_PWM_DEFAULT_CONFIG_1CH(20000L, 31);
    pwm1_cfg.pin_polarity[0] = APP_PWM_POLARITY_ACTIVE_HIGH;
    /* Initialize and enable PWM. */
    err_code = app_pwm_init(&PWM1, &pwm1_cfg, NULL/*pwm_ready_callback*/);
    APP_ERROR_CHECK(err_code);
    app_pwm_enable(&PWM1);
    // minimum 800, maximum 5100 0 = 2950
    // 1 tick = 0.5 usec
    //while (app_pwm_channel_duty_set(&PWM1, 0, 10) == NRF_ERROR_BUSY);
    //while (app_pwm_channel_duty_ticks_set(&PWM1, 0, 10000) == NRF_ERROR_BUSY);
    while (app_pwm_channel_duty_ticks_set(&PWM1, 0, 2950) == NRF_ERROR_BUSY);
    //APP_ERROR_CHECK(app_pwm_channel_duty_set(&PWM1, 1, 200));

#else
    nrf_drv_pwm_config_t config;

    ////////////////////////////////////////////////////////////////////////////
    // PWM0 initialization.

    config.irq_priority   = APP_IRQ_PRIORITY_LOWEST;
    config.count_mode     = NRF_PWM_MODE_UP;
    config.step_mode      = NRF_PWM_STEP_AUTO;
    config.output_pins[0] = 31 | NRF_DRV_PWM_PIN_INVERTED;
    config.output_pins[1] = NRF_DRV_PWM_PIN_NOT_USED;
    config.output_pins[2] = NRF_DRV_PWM_PIN_NOT_USED;
    config.output_pins[3] = NRF_DRV_PWM_PIN_NOT_USED;
    config.base_clock     = NRF_PWM_CLK_125kHz;
    config.top_value      = 31250; // 250ms period
    config.load_mode      = NRF_PWM_LOAD_INDIVIDUAL;
    config.step_mode      = NRF_PWM_STEP_AUTO;
    APP_ERROR_CHECK(nrf_drv_pwm_init(&m_pwm0, &config, NULL));
#endif
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    NRF_LOG_INFO("Step 1");
    services_init();
    NRF_LOG_INFO("Step 2");
    conn_params_init();
    peer_manager_init();

    THPSensor* thp_sensor = new THPSensor();

    // Start execution.
    NRF_LOG_INFO("Template example started.");
    application_timers_start();

    advertising_start(erase_bonds);

    nrf_gpio_pin_write(RELAY_1, 1);
    nrf_gpio_pin_write(RELAY_2, 1);
    nrf_gpio_pin_write(RELAY_3, 1);
    nrf_gpio_pin_write(RELAY_4, 1);

    //APP_ERROR_CHECK(nrf_drv_clock_init());
    pwm_init();
    // Enter main loop.
    for (;;)
    {
        thp_sensor->task();
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
